
const data = {
  teams: [
    ["Grasped Shamped Morped Phazed Draped	", "Aurora"],
    ["ผมมาแจก", "เหนื่อยฟรีไม่มีถ้วย"],
    ["The ÉLAN", "While Cat Esports"],
    ["โชคเหนือฝีมือ", "ผมยอมแล้วคับพรี่"],
    ["พยัคฆ์ร้าย777", "พี่มาแล้วน้อง"],
    ["แก๊งค์คนป่วย	", "Fieryer E-SPORT"],
    ["นี้คนหรือขี้", "Nightmare"],
    ["Chickennut", "เละเทะ อีสปอร์ท"],
    ["Thunder express", "พี่จ๋าป้อมจะแตก"],
    ["มาตบchicken", "I am gay"],
    ["ไม่เหม็นสำหรับผม", "Jaaocto"],
    ["ชายสามเกย์สอง", "ช้างเผือก"],
    ["MY Ego", "นักรบมังกรกำลังจะกลับบ้าน"],
    ["หมีเนยฮิลใจ","แก๊งราชภัฏหัวหิน"],
    [null, null],
    [null, null]

  ],
  "results": [
    [
      [1, 0], [0, 1], [1, 0], [1, 0], [0, 1], [1, 0], [1, 0], [1, 0], [0, 1], [0, 1],
      [0, 1], [1, 0],[0, 1], [0, 1]
    ],
    [
      [1, 0], [1, 0], [0, 1], [0, 1],
      [0, 1], [0, 1], [0, 1]
    ],
    [
      [0, 0], [0, 0], [0, 0], [0, 0]
    ],
    [
      [0, 0], [0, 0]
    ],
    [
      [0, 0]
    ]
  ]
}

$(function () {
  $('#tournament').bracket({
    init: data,
    teamWidth: 100,      // ความกว้างของช่องทีม
    scoreWidth: 30,      // ความกว้างของช่องคะแนน
    matchMargin: 30,     // ระยะห่างระหว่างแมตช์
    roundMargin: 50      // ระยะห่างระหว่างรอบ
  });
});

//////////////////////////////////////////////////////////////////////////////
const tada = {
  "teams": [
    ["Aurora","ผมมาแจก"],
    ["เหนื่อยฟรีไม่มีถ้วย",  null],
    ["While Cat Esports", "ผมยอมแล้วคับพรี่"],
    ["โชคเหนือฝีมือ",  null],
    ["พยัคฆ์ร้าย777", "Fieryer E-SPORT"],
    ["พี่มาแล้วน้อง", null],
    ["Nightmare", "เละเทะ อีสปอร์ท"],
    ["นี้คนหรือขี้",  null],
    ["Thunder express","มาตบchicken"],
    ["พี่จ๋าป้อมจะแตก", null],
    ["ไม่เหม็นสำหรับผม", "ช้างเผือก"],
    ["Jaaocto",  null],
    ["MY Ego", "หมีเนยฮิลใจ"],
    ["นักรบมังกรกำลังจะกลับบ้าน", null],
    [null, null],
    [null, null]
  ],
  "results": [
    [
      [0, 1],[0, 0],[0, 1],[0, 0],[1, 0],[0, 0],[1, 0],[0, 0],[0, 1],[0, 0],[0, 1],[0, 0],[1, 0],[0, 0],[0, 0],[0, 0],
    ],
    [
      [0, 0], [0, 0], [0, 0], [0, 0]
    ],
    [
      [0, 0], [0, 0]
    ],
    [
      [0, 0]
    ]
  ]
}

$(function () {
  $('#tournament2').bracket({
    init: tada,
    teamWidth: 100,      // ความกว้างของช่องทีม
    scoreWidth: 30,      // ความกว้างของช่องคะแนน
    matchMargin: 30,     // ระยะห่างระหว่างแมตช์
    roundMargin: 50      // ระยะห่างระหว่างรอบ
  });
});
//////////////////////////////////////////////////////////////////////////////
const oneonone = {
  "teams": [
    [null, null]
  ],
  "results": [
    [0, 0]
  ]
}

$(function () {
  $('#tournament3').bracket({
    init: oneonone,
    teamWidth: 300,      // ความกว้างของช่องทีม
    scoreWidth: 30,      // ความกว้างของช่องคะแนน
    matchMargin: 50,     // ระยะห่างระหว่างแมตช์
    roundMargin: 50      // ระยะห่างระหว่างรอบ
  });
});
